app/controllers/articles_controller.rb

  def create
    @article = Article.new(article_params)
    if @article.save
---
INSERT INTO "articles" ("title", "body", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["title", "123"], ["body", "asl;dgnvl.xcnbknerlgv"], ["created_at", "2024-04-26 09:23:10.325175"], ["updated_at", "2024-04-26 09:23:10.325175"]]